[
  {
    "id": 1,
    "name": "Hitali1",
    "review": "Sir thank you much for your efforts. Sir muze market me 3+ year ho chuke the I know everything like chart patter, how to use indicators, candlesticks etc. but most important jo me observe kiya ki mere friend and me every time support and resistance different draw krte the not different we can say little bit change but jo supply demand ke levels hote he oo all same draw krte he. after this class I realised the importance of supply and demand zone.supply and demand zone se meri accuracy increase hui. And real BB and Breakout find krne me help hui. Thank you so much sir for your support and guidance",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 2,
    "name": "hitali4",
    "review": "Hello sir, This is the feedback regarding Institution Footprints. I saw your pre recorded video then I joined your mentorship. At that time candlestick-time concept was totally new for me. Never heard. If I talk about teaching then all lectures are well arranged. Teaching method is also so simple. Definitely Supply Demand Zones are way more advanced than everything. In my past 2 months my confidence is on high because I'm seeing that stock is bouncing back from the same levels which we marked. Overall my view is completely changed & now on recording 03. Accepted the 23 days challenge as well. I like your daily follow up regarding doubts. No one is doing such things for their students. Deployed Tom Bankbees as well. Amount is 400 everyday. Will increase quarterly. Special thanks to Dhruv sir Thanks once again Regards.",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 3,
    "name": "hitali8",
    "review": "Hi Sir, I have been involved in the market for the past 4 years, starting with random trading and then learning about fundamental and technical analysis. Throughout my journey, I completed multiple courses from Telegram and watched YouTube tutorials, but nothing seemed to work consistently for me. Then I came across Let's Trade India through YouTube, and joined the membership program turned out to be the best decision of my trading career. Krunal sir you provides clear explanations from basic to advanced concepts, addressing all my doubts. I am truly grateful for your genuine support and assistance. Your teachings have made a profound impact on me. I now have a better understanding of the market and feel inspired to overcome my past losses. Thank you to Let's Trade India and the mentors for your unwavering commitment to my success. Not using Tom Bankbees but will do in future, Thank you so much sir!!",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 4,
    "name": "hitali12",
    "review": "Regarding Feedback, First of all thanks, kyuki 23 days ka course 35 days chala gaya but aapka energy vahi raha Agar course ki baat kare toh aaj tak maine iss tarike se stock market kabhi nahi sikha. Har bar stock mere buying ke baad niche hee jata tha. But ab buy karte hee stock vaha ruk jata hai & then 2-4 din mai up bhi jata hai. Thanks for sharing this precious theory with us. Confidence alag level pr hai abb. Thanks once again & will catch you once again in batch 11",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 5,
    "name": "hitali13",
    "review": "Hiii sir, Ye mere 4th course tha stock market ka. But last 3 mai jitna sikha tha utna aapne toh first 7 lecture mai hee wrong prove kar diya. Tab dar lag raha tha but after 20 lecture sab clear huva ki aapne kyu wrong prove kiya tha Peak-Valley, Flip Zones bshot sahi se chalte hai.. Maine trade bhi kiye hai. Supply Demand Zones ko bahot in depth sikha hu. Bass abb practice chalu hai. Thanks to you!!",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 6,
    "name": "hitali15",
    "review": "In my more than 2 years of trading its the first time that in falling market my portfolio is not 10-15% red. Rather its Green and I'm earning 6-8% in many stocks. Thanks a million for your precious teaching.. I can't express in words what I'm feeling.. Thanks!!",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 7,
    "name": "hitali17",
    "review": "Good Evening Sir, Jyada nhi bas itna khna hai ki 2-3 year se market me hu aur chart ke name pe sirf itna pta tha ki candle stick hoti hai. Lekin ab chart me najar sidha SZ/DZ p jati hai. Kabhi nhi socha tha ki koi course krunga but twiter pe apke course ka recommendation dekh ke without any questions enroll kar liya. And The way u teach is great itni detail me samjate ho ki fresher ko bhi sare doubt asani se clear. Apke way of teaching se lagta hai ki ap sirf sikhane ke lie padate ho. Each and every student ki query ka reply. Thankyou sir u are doing great job. Course se kafi kuch Sikh liya aur abhi bahut kuchh sikhna baki hai. Preshan krte rhenge...",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 8,
    "name": "hitali20",
    "review": "Sir 35 days earlier even if someone ask me to find support and resistance I would not be able to do that. And this line always attracts me. I consider it as some sort of gambling..... But after 35 days......... I may not be an expert but yes I know the thought process now. I may not believe my self but i now can trade with the belief this is what our mentor guide us to do. Being a shy personality to call someone everytime, you provide a community platform with which I can ask the problem I am facing. Apart from providing knowledge you are trying to inculcate good practices that must be present inside a trader. This is not the part of syllabus but this is essential. Next you also covers the point on which we have to focus in future... Like 1.9% risk to reward and 2-3 more points that you tell that they might be used for traps etc. So it's shows your will to deliver I really appreciate that and thanks for your efforts. You may even target people that have knowledge of share market but still you admit ones that have zero knowledge. Conclusion:: 10/10....",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 9,
    "name": "hitali21",
    "review": "Hello sir, Pahile bhi trade karta tha mai but har bar 1 problem aati thi ki jab bhi kabhi Stock ko buy karta tha tab dar lagta tha ki iske niche gaya toh kya hoga kyuki paisa bahot kam tha us time. But sbhi demand zone se 1 baat toh clear ho gayi ki quality ka zone ho toh vo demand zone hee vo point hai jaha se stock upar aayega. Abhi vo purana vala problem bhi solved ho gaya. Thanks!! Bahot sahi theory hai supply demand zone ki. Price action kaise form hoti hai ye hee clear ho gaya. Pahile lagta tha chart patterns se market chalta hain but after 24th lecture samja ki chart patterns ko banane vale hee supply demand zones hai. Mere side se koi recommendation nahi hai. Sab sahi laga mujhe teaching speed se leke teaching methods tak...",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 10,
    "name": "hitali22",
    "review": "Hello krunal, shobhit here. First of all, thank you for all the knowledge you have shared with us. Not enrolling in batch 8 was my biggest mistake, as I realized after the peak and valley lecture. Your teaching style is even more perfect than I expected. You know very well how to create excitement in your teaching. The relatives home example was mind-blowing 100 Our community is also doing well. Due to my busy schedule, I am not able to check the market as frequently as I would like, but the supply and demand zones concept that I learned from you is supreme. I am witnessing the same in my current trades. Thanks again! Best regards, Shobhit.",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 11,
    "name": "hitali23",
    "review": "Joining this course was the best decision of my life..the dedication with which sir was teaching was outstanding all the sessions were informative, valuable and exceeded my expectations.. Never seen a teacher who doesn't end the class until all the doubts of students are cleared irrespective of the class timings.. I must also appreciate the way you made us grasp the concepts and theories from basic to advance so intensely..and guiding us through homework... Even I had some knowledge of demand and supply theory but after attending the classes I was able to find the logic behind the chart now it's like reading the chart like we read the books.. Tombees was the best part for the wealth creation the research done for tombees and explaining it us in easy way was outstanding.. Sir is always ready to solve our doubts even on weekends and sir have been the best at explaining things in multiple way untill we get the point clear.. My best wishes to sirji and whole team and our community.Keep growing.. Thank you so much sirji..I just wish that one day I will make you feel proud of me... Thank you sirji and whole LTI team and comunity",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 12,
    "name": "hitali25",
    "review": "Hello Sir, Thank you for teaching us!! You provided more than enough. Before these classes I didn't know how to trade in market. Earlier I just bought stocks and hold them. By someone's influence I did intraday, fno too and lost something nearly 20k in starting phase. After that I stopped everything. After 2 years later I found you and you taught us how to trade. Now I know how it works. So I will definitely work hard and practice. I missed some classes due to election duty and wedding in my family. Now I am on Revision Mode. Thank you so much for your precious knowledge. Yours KRIPAL SINGH CHUNDAWAT",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 13,
    "name": "hitali28",
    "review": "Sir, i am writing this review by the feeling which is coming from the bottom of my heart. I was born in a lower middle class family and struggled a lot financially. I started working at the age of 18 by studying day time. I didn't feel tired at any time to learn and always felt knowledge hungry. With that work I cracked my Govt job, not one continuous 4 govt jobs. Afterwards I tried to train the people around me to get success in their life. But, i didn't find one who focused continuously for success. Whenever I am learning from you, you look like me only. Nowadays, finding the best teacher is a tough task. But I succeeded. This is the one mentorship dead end for all other courses. Really I learnt so much from your mentor ship. Most of the people explained strategy only. But you will explain the logic behind. I found a great team here to discuss and compete. I really enjoyed learning and confident to trade. Your patience level impressed me a lot. Once again thank you very much sir",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 14,
    "name": "hitali29",
    "review": "Krunal Sir, You are an amazing teacher, I have been learning from you since 2 months and it has been a great experience, I have learned so much in my classes with you sir. You are thorough in the subject and you put a lot of thought into how you present the material to the students. Sir, you have great patience and you are very supportive. Yous teaching methods are great, very clear and concise. Earlier I was trading in stock market without proper entry and exit system, and now I am able to do that in confidence, thanks a ton for sharing your knowledge to us. Your passion and dedication is beyond words. Hats of to you Sir!!!",
        "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
    {
    "id": 15,
    "name": "hitali31",
    "review": " You as a teacher and going forward as mentor is the blessing for students, this would be the last thing that I could have asked for.. amazing teaching and the follow through is the most important part which almost everyone ignore and that follow through from your side has added this learning to next level..... jaise cricket me bat ka follow through chaiye hota hai taaki six bahut door tak jaye.... waise hi aapke follow through se ye learning next level pe jaane wali hai... thank you so much sir for giving precious knowledge, last 2 months were really good and missing your live voice offcourse offline toh baat karenge hi.. Again, I am glad that I found you and enrolled for learning.. thanks you and god bless you.",
       "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
    {
    "id": 16,
    "name": "hitali32",
    "review": "Its the first time in my life where I saw a teacher putting in more effort compared to the students.. I feel guilty of not putting in the required efforts due to office boundations but I have been going through the recorded lectures and preparing notes... but the system of trading that you have offered is really mind blowing and if religiously followed it can do wonders! Hats off and thankyou!!",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 17,
    "name": "hitali34",
    "review": "Sir first of all enjoyed your every lecture mtlb hr lecture m kuch nya seekha h or ab repeat karta hu to wapas kuch na kuch nya milta h phle mostly stock leta tha to 1 saal rkhna pdta tha return mil jaata tha par wait bhut karna pdta tha ab to entry pta h exit pta h target pta chart pdhna seekh rha hu mtlb ab aisa h ek din m 1.5% mil jaata h mere ko to bhut acha Igta h jb stock lete hi up chla jaata h feeling blessed k mene youtube pr aapke analysis dekh liye thoda lag kar rha hu because of shifting to another state settle hone m time Iga pr ab wapas se start krdiya h analysis bhut kuch knowledge add hui h or hoti rhegi aapka support or group pr baaki sb logo ka support bhut help krta h i will and want to learn lifetime from you abhi bhle hi ache se nhi aaya h pr poora try krta hu sb kuch seekhu thanku for this valuable lesson sir kbhi mauka Iga life m to milunga jrur or same word bolna chaunga k aapki wjh se salary pr depend nhi krta hu income k liye bs yhi chaye tha life m",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
  {
    "id": 18,
    "name": "hitali36",
    "review": "Sir a honest feedback, Your teachings have helped me to look trading from a all new perspective and build upon whatever little experience I have had. I liked the way you put in hard work for conducting classes, to clear doubts with revision and repeat session even at the cost of extending course by few more days. The way you clear our doubt speak volumes about your patience level. Also the way full course has been managed on digital platform needs appreciation for unencrypted conduct of course, quality of videos for revision and management of telegram groups. I am sure all of us will cherish and use the learnings. Happy learning and happy trading Thank you so much",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
   {
    "id": 19,
    "name": "hitali37",
    "review": "Thanks Sirji for your valuable training sessions and hardwork you have put all these sessions. Believe me, I have paid 25k to one of the trainer in 2021 for two weekends and wo itna details mein nahi sikhaya jitna details mein aap ne har session liya hai. First I used to take random trades on indicators, now since the session started I am able to analyse quality trades. Mera ek hi feedback tha timings ko lekar, jo shayad baakiyon ke liye issue nahi hoga. 9 to 11 thoda late ho jata hai, keeping in my mind ye 11 ke aage bhi extend hota tha weekdays mein. Working professionals like me who start from home at 7.00 am becomes difficult to catch live sessions and have to depend on recorded videos which get stacked till weekend. But Thanks to your recap on Sundays. Thanks for the teaching and look forward to learn more from you",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
   {
    "id": 20,
    "name": "hitali39",
    "review": "",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
   {
    "id": 21,
    "name": "hitali40",
    "review": "Good morning Kunal sir, All the thanks for your lovely and simple teaching. I am a beginner in this field. I watched lots of You Tube videos before entering this field. But believe me your teaching and explaining things are at different levels. Unfortunately I couldn't attend some of your Institution footprints & F&O lectures as I am a working guy who spent most of my time in the office (Mon - Sat) and local traveling. Last 2-3 weeks I missed all the classes due to some family commitments. Hence I couldn't complete homework given by you. But I promise you I will restart watching all our lectures from day 1 and complete the concept and homework. This is 700. I don't want to lose a mentor like you who wants his students to do well even after completing courses. My all wishes are with 'Let's Trade India Family'. Keep growing.",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  },
   {
    "id": 22,
    "name": "hitali41",
    "review": "Sir, I am a long term investor. Hence, i will not be trading SZ DZ as such. But the knowledge of base candles is superb! I use 70% Fundamental Analysis and 30% Technical Analysis on Weekly and Monthly Charts. I have noticed that corrections end at base candles on Weekly. And bear markets end at base candles on Monthly. I will use this knowledge to buy in bear markets. Sir, you have taught this course very patiently. Other courses are taught for just a few days and usmein bhi there are many pre-recorded lectures. SZ DZ works like a beauty. Thank you for teaching us so passionately and patiently!!",
    "image": "https://i.pravatar.cc/150?img=1",
    "city": "Mumbai",
    "state": "Maharashtra",
    "profession": "Batch"
  }
]